content/imported/tutorials/partitioned-backwards-facing-step/fluid2-openfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel      Newtonian;


nu              nu [ 0 2 -1 0 0 0 0 ] 0.00001;	//Re 100
//nu              nu [ 0 2 -1 0 0 0 0 ] 0.0001;	//Re 1000
