content/imported/tutorials/partitioned-backwards-facing-step/fluid2-openfoam/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType          laminar;
